<template>
  <div class="hide-container">
    <div class="main">
      <div class="title">兼爱</div>
      <div class="author">墨子 〔先秦〕</div>
      <div class="main-content">
        <p>
          子墨子言曰：“仁人之所以为事者，必兴天下之利，除去天下之害，以此为事者也。”然则天下之利何也？天下之害何也？子墨子言曰：“今若国之与国之相攻，家之与家之相篡，人之与人之相贼，君臣不惠忠，父子不慈孝，兄弟不和调，此则天下之害也。”
        </p>
        <p>
          然则察此害亦何用生哉？以不相爱生邪？子墨子言：“以不相爱生。今诸侯独知爱其国，不爱人之国，是以不惮举其国以攻人之国。今家主独知爱其家，而不爱人之家，是以不惮举其家以篡人之家。今人独知爱其身，不爱人之身，是以不惮举其身以贼人之身。是故诸侯不相爱则必野战，家主不相爱则必相篡，人与人不相爱则必相贼，君臣不相爱则不惠忠，父子不相爱则不慈孝，兄弟不相爱则不和调。天下之人皆不相爱，强必执弱，富必侮贫，贵必敖贱，诈必欺愚。凡天下祸篡怨恨，其所以起者，以不相爱生也，是以仁者非之。”
        </p>
        <p>
          既以非之，何以易之？子墨子言曰：“以兼相爱、交相利之法易之。”然则兼相爱、交相利之法将奈何哉？子墨子言：“视人之国若视其国，视人之家若视其家，视人之身若视其身。是故诸侯相爱则不野战，家主相爱则不相篡，人与人相爱则不相贼，君臣相爱则惠忠，父子相爱则慈孝，兄弟相爱则和调。天下之人皆相爱，强不执弱，众不劫寡，富不侮贫，贵不敖贱，诈不欺愚。凡天下祸篡怨恨可使毋起者，以相爱生也，是以仁者誉之。”
        </p>
        <p>
          然而今天下之士君子曰：“然，乃若兼则善矣。虽然，天下之难物于故也。”子墨子言曰：“天下之士君子特不识其利、辩其故也。今若夫攻城野战、杀身为名，此天下百姓之所皆难也，苟君说之，则士众能为之。况于兼相爱、交相利，则与此异！夫爱人者，人必从而爱之；利人者，人必从而利之；恶人者，人必从而恶之；害人者，人必从而害之。此何难之有？特上弗以为政、士不以为行故也。昔者晋文公好士之恶衣，故文公之臣皆牂羊之裘，韦以带剑，练帛之冠，入以见于君，出以践于朝。是其故何也？君说之，故臣为之也。昔者楚灵王好士细要，故灵王之臣皆以一饭为节，胁息然后带，扶墙然后起。比期年，朝有黧黑之色。是其故何也？君说之，故臣能之也。昔越王勾践好士之勇，教驯其臣，私令人焚舟失火，试其士曰：‘越国之宝尽在此！’越王亲自鼓其士而进之。士闻鼓音，破碎乱行，蹈火而死者左右百人有余，越王击金而退之。”是故子墨子言曰：“乃若夫少食恶衣、杀身而为名，此天下百姓之所皆难也，若苟君说之，则众能为之，况兼相爱、交相利与此异矣。夫爱人者，人亦从而爱之；利人者，人亦从而利之；恶人者，人亦从而恶之；害人者，人亦从而害之。此何难之有焉？特士不以为政而士不以为行故也。”
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'HideView',
  data () {
    return {
      password: localStorage.password || ''
    }
  }
}
</script>

<style lang="less" scoped>
@import '../assets/less/color';
.hide-container {
  display: flex;
  flex: 1;
  flex-direction: column;
  align-items: center;
  height: 100%;
  overflow-y: scroll;
}
.main {
  display: flex;
  flex-direction: column;
  flex: 1;
  width: 90%;
  margin-top: 20px;
  .title {
    font-weight: 800;
    font-size: 25px;
  }
  .author {
    margin-top: 10px;
  }
  .main-content {
    p {
      text-indent: 2em;
      font-size: 1.5em;
    }
  }
}
</style>
